[
  {
    "title": "SHIB.CM= Surges 2.72% to $0.00001320 Amid Renewed Market Interest",
    "summary": "Shiba Inu (SHIB.CM=) has experienced a notable uptick, rising 2.72% to $0.00001320 as of the last trade at 3:40 AM EDT. This increase reflects growing investor enthusiasm in the meme-coin sector, likely driven by broader cryptocurrency market momentum and speculative trading activity.\n\nThe price movement suggests renewed interest in SHIB as traders seek potential upside in lower-priced digital assets. Investors should monitor ongoing market developments closely, as volatility remains a key factor in this segment.\n\nFor real-time tracking of SHIB's performance and further market updates, visit the live quote page below.\n\nhttps://www.cnbc.com/quotes/SHIB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:41:01.772788"
  },
  {
    "title": "Cardano (ADA) Gains 3.25% to $0.69 Amid Renewed Market Interest",
    "summary": "Cardano (ADA) has seen a notable uptick, climbing 3.25% to $0.69 as of the latest trade at 3:40 AM EDT. This positive movement reflects renewed investor confidence possibly driven by recent developments or broader market trends favoring altcoins.\n\nTraders are keeping a close eye on ADA as it demonstrates resilience in a volatile crypto environment, suggesting potential momentum for further gains. For those tracking real-time price action and market sentiment, live updates are available.\n\nhttps://www.cnbc.com/quotes/ADA.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:56.131374"
  },
  {
    "title": "DOT.CM= Rises 3.67% to $4.18 Amid Renewed Market Interest",
    "summary": "DOT.CM= gained momentum early today, climbing 3.67% to close at $4.18. This uptick reflects increased investor confidence possibly driven by recent sector developments and broader market recovery trends.\n\nTraders and analysts are keeping a close eye on DOT.CM= as it shows signs of breaking through recent resistance levels, suggesting potential for further gains. Market participants may want to monitor live price movements for timely entry and exit opportunities.\n\nStay updated with live real-time quotes and in-depth market insights here:\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n\nKeep an eye on how this momentum unfolds in the coming sessions as market dynamics evolve.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:50.621345"
  },
  {
    "title": "UNI.CM= Advances 2.25% to $6.40 Amid Positive Momentum",
    "summary": "UNI.CM= shares climbed 2.25% to close at $6.40 as of the last trade at 3:40 AM EDT, reflecting renewed investor interest and positive market sentiment.\n\nThis uptick may signal growing confidence in the underlying fundamentals or broader sector strength. Traders should monitor ongoing developments closely as this price movement could indicate the start of a sustained rally.\n\nStay updated with live real-time quotes and market data here:\n\nhttps://www.cnbc.com/quotes/UNI.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:45.682698"
  },
  {
    "title": "LTC.CM= Advances 1.26% to $89.56 Amid Positive Market Momentum",
    "summary": "Litecoin (LTC.CM=) continued its upward trajectory, closing at $89.56, up 1.11 points or 1.26% as of the last trade at 3:40 AM EDT.\n\nThe cryptocurrency showed signs of renewed investor confidence, potentially driven by broader market optimism and favorable technical indicators. This gain reflects growing interest in digital assets as traders seek opportunities in a volatile environment.\n\nFor real-time updates and detailed price tracking, visit the live quote page below.\n\nhttps://www.cnbc.com/quotes/LTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:39.238895"
  },
  {
    "title": "SOL.CM= Surges 4.99% to $160.04 Amid Market Momentum",
    "summary": "SOL.CM= experienced a notable uptick, closing at $160.04, up $7.60 or 4.99% as of the last trade at 3:40 AM EDT. This strong performance reflects growing investor confidence and positive sentiment surrounding the stock.\n\nThe significant gain suggests underlying factors such as favorable market conditions or company-specific developments driving demand. Traders and investors should monitor this momentum as it may indicate continued upward movement or increased volatility.\n\nFor those seeking real-time updates and detailed tracking, live quotes are available here:\n\nhttps://www.cnbc.com/quotes/SOL.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:34.227071"
  },
  {
    "title": "BNB Climbs 0.90% to $666.42 Amid Positive Market Momentum",
    "summary": "BNB (BNB.CM=) showed a notable gain, rising by 0.90% to close at $666.42 as of the last trade at 3:40 AM EDT. This uptick reflects growing investor confidence in BNB's market positioning and recent developments within the crypto sector.\n\nTraders are watching closely as BNB maintains its upward trajectory, signaling potential continued strength in the short term. For those tracking BNB in real-time, live updates are available to monitor this momentum closely.\n\nhttps://www.cnbc.com/quotes/BNB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:28.199323"
  },
  {
    "title": "Ethereum (ETH) Surges 3.20% to $2,616.62 Amid Renewed Market Optimism",
    "summary": "Ethereum (ETH) showed notable strength in early trading, climbing 3.20% to reach $2,616.62 as of the last update at 3:39 AM EDT. This upward movement reflects growing investor confidence in the crypto sector, possibly driven by positive developments in blockchain adoption and broader market sentiment.\n\nThe 81.09 point gain underscores a robust rebound, suggesting that ETH is regaining momentum after recent volatility. Traders and investors should watch for continued price action closely, as this could signal further upside potential or a consolidation phase.\n\nFor those tracking Ethereum in real-time, live quotes and updates are available for continuous market insights.\n\nhttps://www.cnbc.com/quotes/ETH.CM=\n\nStay tuned for more updates on Ethereum and the evolving cryptocurrency landscape.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:21.921566"
  },
  {
    "title": "Bitcoin (BTC.CM=) Climbs to 105,316 Amid Renewed Market Optimism",
    "summary": "Bitcoin has advanced by 0.91% to a price of $105,316 as of the latest trade at 3:39 AM EDT, reflecting a gain of 953.38 points. This upward movement suggests renewed investor confidence despite recent volatility in the cryptocurrency sector.\n\nMarket participants are closely watching Bitcoin's performance as it approaches key resistance levels, with potential implications for broader crypto market sentiment. The current price action may signal strengthening momentum, possibly influenced by macroeconomic factors and increasing institutional interest.\n\nStay informed with live real-time price updates and market data here:\n\nhttps://www.cnbc.com/quotes/BTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-03T07:40:16.196856"
  },
  {
    "title": "Trending Now\n\nEthereum USD rises to $2616.02",
    "summary": "Trading at $2616.02 with a +4.43% change. Market cap: $315.8B, 24h volume: $20.0B",
    "link": "https://finance.yahoo.com/quote/ETH-USD",
    "image_url": null,
    "timestamp": "2025-06-03T13:40:15.657739"
  },
  {
    "title": "ConSensys says Web3Auth acquisition to greatly improve MetaMask UX",
    "summary": "ConSensys has acquired Web3Auth, which it says will help it improve the user experience for its popular MetaMask crypto wallet.",
    "link": "https://cointelegraph.com/news/consensys-acquires-web3auth-improve-metamask-ux",
    "image_url": null,
    "timestamp": "2025-06-03T13:40:14.650888"
  },
  {
    "title": "Coinbase aware of recently disclosed data leak since January: Reuters",
    "summary": "Reuters reports that Coinbase was made aware in January that an employee of an outsourcing company could have leaked its customer data, months before its recent public disclosure.",
    "link": "https://cointelegraph.com/news/coinbase-aware-recently-disclosed-data-leak-months-reuters",
    "image_url": null,
    "timestamp": "2025-06-03T13:40:14.650888"
  },
  {
    "title": "Norwegian crypto platform spikes 138% on Bitcoin treasury plan",
    "summary": "Shares in the Norwegian Block Exchange jumped 138% on June 2 after the crypto exchange said it bought 6 Bitcoin and planned to buy many more.",
    "link": "https://cointelegraph.com/news/norwegian-block-exchange-stock-rises-bitcoin-plan",
    "image_url": null,
    "timestamp": "2025-06-03T13:40:14.650888"
  },
  {
    "title": "Crypto lobby pushes Senate to pass stablecoin bill without debate",
    "summary": "The GENIUS Act could soon be up for Senate debate and crypto lobbyists urged senators to quickly pass the bill as amendments on credit card fees threaten to delay the bill.",
    "link": "https://cointelegraph.com/news/crypto-lobby-pushes-senate-pass-stablecoin-bill-without-debate",
    "image_url": null,
    "timestamp": "2025-06-03T13:40:14.650888"
  },
  {
    "title": "Cardano (ADA) dips 1.36% to $0.67 in early trading",
    "summary": "Cardano (ADA) experienced a modest pullback this morning, with the price declining 1.36% to $0.67 as of 7:12 AM EDT. This movement reflects cautious sentiment among investors amid broader market volatility affecting the cryptocurrency sector.\n\nDespite the minor setback, ADA remains under close watch as market participants evaluate upcoming technical catalysts and potential shifts in investor appetite. Traders and analysts are monitoring key support levels to gauge the next directional move for the asset.\n\nStay updated with live, real-time quotes and market data here:\n\nhttps://www.cnbc.com/quotes/ADA.CM=\n\nKeep an eye on ADA as it navigates current market dynamics and broader crypto trends.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:41.002192"
  },
  {
    "title": "DOT.CM= slides to $3.98 amid market pressure",
    "summary": "DOT.CM= experienced a decline of 1.40%, dropping 6 cents to close at $3.98 as of the last trade at 7:12 AM EDT. This movement reflects a cautious sentiment among investors, potentially influenced by broader market dynamics or sector-specific developments.\n\nInvestors should monitor upcoming catalysts and market trends that could impact DOT.CM= further. For those seeking real-time updates and detailed tracking, live quotes are available.\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:35.540318"
  },
  {
    "title": "UNI.CM= dips slightly to $6.17 amid cautious market sentiment",
    "summary": "UNI.CM= shares experienced a modest decline, slipping 0.46% to close at $6.17 as of 7:12 AM EDT. This small pullback reflects a cautious tone among investors, possibly influenced by broader market uncertainties or sector-specific dynamics.\n\nDespite the slight downturn, the price remains relatively stable, suggesting that traders are awaiting clearer signals before making significant moves. Keeping an eye on upcoming economic data or company-specific news could provide further direction for UNI.CM=.\n\nTrack real-time price changes and market developments for UNI.CM= here for up-to-the-minute insights.\n\nhttps://www.cnbc.com/quotes/UNI.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:28.397964"
  },
  {
    "title": "LTC.CM= edges up 0.45% to $88.29 in early trading",
    "summary": "LTC.CM= showed a modest gain of 0.45%, rising by $0.40 to reach $88.29 as of 7:12 AM EDT. This early uptick suggests cautious optimism among investors, potentially reflecting positive sentiment or early market catalysts driving demand.\n\nInvestors should keep an eye on upcoming developments that could influence momentum, as this slight increase may signal the beginning of a broader trend or simply a short-term correction. For those monitoring positions closely, live tracking is available for real-time updates and deeper market insights.\n\nhttps://www.cnbc.com/quotes/LTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:21.902772"
  },
  {
    "title": "SOL.CM= slips 0.78% to $154.35 amid cautious market sentiment",
    "summary": "SOL.CM= experienced a modest decline, dropping 0.78% to close at $154.35 as of 7:12 AM EDT. This movement reflects a cautious stance among investors, potentially influenced by broader market volatility or sector-specific developments.\n\nDespite the dip, SOL remains in focus for traders looking to capitalize on short-term fluctuations. Monitoring real-time data can provide additional insights into intraday momentum and investor sentiment.\n\nFor those tracking SOL.CM= live, up-to-the-minute quotes and detailed market data are available here:\n\nhttps://www.cnbc.com/quotes/SOL.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:16.593014"
  },
  {
    "title": "BNB (BNB.CM=) Dips 0.43% to $651.89 Amid Market Volatility",
    "summary": "BNB shares edged lower by 0.43%, closing at $651.89 as of 7:12 AM EDT, reflecting a modest pullback in the broader market sentiment. The $2.83 decline suggests cautious investor positioning amid fluctuating crypto and tech sector dynamics.\n\nThis movement highlights a slight pause after recent rallies, indicating that traders may be digesting recent gains or reacting to external economic factors impacting digital asset valuations.\n\nFor real-time updates and live tracking of BNB’s performance throughout the trading day, visit the link below:\n\nhttps://www.cnbc.com/quotes/BNB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:09.590980"
  },
  {
    "title": "Ethereum (ETH) Dips 1.40% to $2,487.25 Amid Market Volatility",
    "summary": "Ethereum (ETH) experienced a notable pullback, slipping 1.40% to trade at $2,487.25 as of 7:11 AM EDT. This decline of $35.22 reflects ongoing market volatility impacting major cryptocurrencies, with investors digesting recent macroeconomic data and regulatory developments.\n\nDespite the dip, Ethereum remains a key player in the crypto space, and traders are closely watching for signs of stabilization or further downside. The current price action underscores the cautious sentiment prevailing among market participants.\n\nFor those tracking ETH in real-time, up-to-date quotes and detailed market data are available here:\n\nhttps://www.cnbc.com/quotes/ETH.CM=\n\nStay tuned for further updates as the market evolves.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:12:02.598761"
  },
  {
    "title": "Bitcoin (BTC) Dips Nearly 0.6% to $104,479.87 Amid Market Volatility",
    "summary": "Bitcoin experienced a moderate pullback, falling by $629.82 or 0.60% to trade at $104,479.87 as of 7:11 AM EDT. This movement reflects ongoing volatility in the cryptocurrency market, where traders remain cautious amid mixed macroeconomic signals and regulatory developments.\n\nDespite the dip, Bitcoin remains above the $100,000 mark, indicating sustained interest from investors. Market participants are closely watching upcoming economic data and policy announcements that could influence the digital asset's trajectory.\n\nFor those seeking live tracking and real-time updates on Bitcoin's price action, visit the link below.\n\nhttps://www.cnbc.com/quotes/BTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:11:55.679485"
  },
  {
    "title": "Trending Now\n\nBitcoin EUR rises to $91349.21",
    "summary": "Trading at $91349.21 with a +0.34% change. Market cap: $1815.0B, 24h volume: $35.0B",
    "link": "https://finance.yahoo.com/quote/BTC-EUR",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:55.136460"
  },
  {
    "title": "Trending Now\n\nBitcoin CAD rises to $142858.36",
    "summary": "Trading at $142858.36 with a +0.34% change. Market cap: $2839.0B, 24h volume: $54.7B",
    "link": "https://finance.yahoo.com/quote/BTC-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:55.137460"
  },
  {
    "title": "Trending Now\n\nBitcoin USD rises to $104311.96",
    "summary": "Trading at $104311.96 with a +0.34% change. Market cap: $2073.0B, 24h volume: $39.9B",
    "link": "https://finance.yahoo.com/quote/BTC-USD",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:55.137460"
  },
  {
    "title": "Binance co-founder CZ proposes dark pool DEXs to tackle manipulation",
    "summary": "Binance co-founder Changpeng CZ Zhao proposed launching a dark pool perpetual DEX to protect large traders from front-running and MEV attacks.",
    "link": "https://cointelegraph.com/news/binance-co-founder-cz-proposes-dark-pool-dexs-against-manipulation",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:54.001293"
  },
  {
    "title": "XRP price risks a 20% crash to $1.70  Here is why",
    "summary": "XRP ledger activity has dropped sharply in the past two months, increasing the downside prospects for XRP price to drop toward $1.70.",
    "link": "https://cointelegraph.com/news/xrp-price-risks-20-crash-1-70-here-is-why",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:54.001293"
  },
  {
    "title": "Crypto funds post $286M inflows as Ether tops buying: CoinShares",
    "summary": "Ether led last weeks $286 million of net inflows to crypto ETPs, while Bitcoin investment products saw outflows of $8 million, CoinShares reported.",
    "link": "https://cointelegraph.com/news/crypto-funds-286-million-inflows-heavy-selling-coinshares",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:54.001293"
  },
  {
    "title": "Singapore orders local crypto firms to cease overseas activity by June 30",
    "summary": "Singapores central bank has set a June 30 deadline for local crypto firms targeting overseas markets to halt operations or face steep penalties, including fines of almost $200,000.",
    "link": "https://cointelegraph.com/news/singapore-crypto-firms-deadline-overseas-digital-token-services",
    "image_url": null,
    "timestamp": "2025-06-02T17:11:54.001293"
  },
  {
    "title": "XRP Drops Slightly to $2.14 Amid Market Volatility",
    "summary": "XRP experienced a modest decline, slipping 0.98% to $2.14 as of 7:10 AM EDT. This movement reflects a cautious market sentiment amid broader cryptocurrency fluctuations.\n\nInvestors are closely monitoring XRP’s price action as it tests support levels, with the slight dip suggesting a potential pause in recent upward momentum. Given the current volatility in crypto markets, traders should stay vigilant for further developments.\n\nFor those seeking real-time updates and live tracking of XRP’s performance, detailed quotes are available at CNBC.\n\nhttps://www.cnbc.com/quotes/XRP.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:51.253182"
  },
  {
    "title": "SHIB.CM= Dips 1.39% to $0.00001273 Amid Market Volatility",
    "summary": "SHIB.CM= experienced a modest decline of 1.39%, closing at $0.00001273 as of 7:10 AM EDT. This movement reflects ongoing volatility in the cryptocurrency market, where investor sentiment remains cautious.\n\nDespite the dip, SHIB continues to capture significant attention due to its community support and speculative interest. Traders are advised to monitor real-time updates closely to navigate the fast-changing landscape effectively.\n\nStay informed with live tracking and detailed quote analysis here:\n\nhttps://www.cnbc.com/quotes/SHIB.CM=\n\nKeeping an eye on such shifts can provide valuable insights for positioning within the crypto space amid broader market fluctuations.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:46.448117"
  },
  {
    "title": "Cardano (ADA) Dips 1.67% to $0.67 Amid Market Volatility",
    "summary": "Cardano (ADA) experienced a modest decline, falling 1.67% to $0.67 as of 7:10 AM EDT. This movement reflects ongoing market volatility impacting mid-cap cryptocurrencies, with investors showing cautious sentiment amid broader economic uncertainties.\n\nDespite the dip, ADA remains a key player in the blockchain space, and its price action today may present strategic entry points for long-term investors keeping an eye on technological developments and adoption trends.\n\nFor those tracking ADA in real-time, stay updated with live market data and analysis here:\n\nhttps://www.cnbc.com/quotes/ADA.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:40.532694"
  },
  {
    "title": "DOT.CM= slips 1.57% to $3.97 amid early market pressure",
    "summary": "Polkadot (DOT.CM=) experienced a modest decline, dropping 1.57% to close at $3.97 as of 7:10 AM EDT. This movement reflects early market pressure possibly driven by broader cryptocurrency sell-offs and investor caution in the altcoin sector.\n\nMarket participants are advised to monitor key support levels as the digital asset navigates a challenging environment. The current price action may suggest short-term bearish sentiment, yet longer-term fundamentals of Polkadot’s ecosystem remain under watch.\n\nFor those tracking live market developments, real-time pricing and updates are available at the link below.\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:33.461068"
  },
  {
    "title": "UNI.CM= edges down to $6.16 amid cautious market sentiment",
    "summary": "UNI.CM= experienced a slight decline, trading at $6.16 with a modest drop of 0.65%. This movement reflects a cautious stance among investors as broader market conditions show mixed signals.\n\nDespite the minor pullback, the price remains near key support levels, suggesting that traders are weighing upcoming economic data and sector-specific news. Monitoring this symbol could provide insights into market momentum in the coming sessions.\n\nFor those interested in real-time updates and live tracking, the latest trading information is available here:\n\nhttps://www.cnbc.com/quotes/UNI.CM=\n\nStay tuned for further developments as the market continues to navigate volatility.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:27.821377"
  },
  {
    "title": "LTC.CM= edges up 0.26% to $88.12 amid steady market momentum",
    "summary": "LTC.CM= showed a modest gain this morning, rising 0.26% to $88.12 as of 7:10 AM EDT. This uptick reflects cautious optimism among investors, potentially driven by underlying sector resilience and positive technical signals.\n\nDespite the modest increase, the price movement suggests steady market momentum rather than volatility, indicating that traders are digesting recent developments without aggressive repositioning.\n\nFor those tracking live market updates, real-time quotes and detailed data are available to monitor ongoing shifts and inform trading decisions.\n\nhttps://www.cnbc.com/quotes/LTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:20.393459"
  },
  {
    "title": "SOL.CM= slips 0.99% to 154.03 amid early market pressures",
    "summary": "SOL.CM= experienced a decline of 0.99%, dropping 1.54 points to close at 154.03 as of 7:10 AM EDT. This early movement reflects some profit-taking or cautious sentiment among investors in the current market environment.\n\nThe dip, while moderate, suggests traders are reacting to broader market dynamics or sector-specific developments impacting SOL.CM=. For those tracking this symbol, the provided link offers live, real-time quote updates to stay informed on further price action throughout the trading day.\n\nStay tuned for more insights as the market progresses.\n\nhttps://www.cnbc.com/quotes/SOL.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:13.603707"
  },
  {
    "title": "BNB.CM= dips 0.60% to $650.80 amid cautious market sentiment",
    "summary": "BNB.CM= experienced a modest decline of 0.60%, closing at $650.80 as of 7:10 AM EDT. The $3.92 drop reflects a cautious tone among investors, possibly driven by broader market uncertainties impacting digital asset-related equities.\n\nDespite the pullback, BNB remains in a strong position, with recent volatility offering potential entry points for strategic investors. Monitoring upcoming market catalysts will be key to anticipating the next move.\n\nFor those tracking the latest developments and live price action, real-time updates are available here:\n\nhttps://www.cnbc.com/quotes/BNB.CM=\n\nStay tuned for further market insights and analysis.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:06.430916"
  },
  {
    "title": "Ethereum (ETH) Dips 1.57% to $2,482.81 Amid Market Volatility",
    "summary": "Ethereum (ETH) experienced a notable decline, slipping 1.57% to $2,482.81 as of the latest trade at 7:09 AM EDT. This movement reflects ongoing market volatility impacting major cryptocurrencies.\n\nInvestors are closely watching Ethereum's price action amid broader crypto market fluctuations and potential regulatory developments. The current dip may present buying opportunities for those anticipating a rebound, but caution remains advised given the uncertain macroeconomic environment.\n\nStay informed with live, real-time updates on Ethereum's price and market trends for actionable insights.\n\nhttps://www.cnbc.com/quotes/ETH.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:10:00.641475"
  },
  {
    "title": "Bitcoin (BTC.CM=) Dips 0.75% to 104,321.06 Amid Market Volatility",
    "summary": "Bitcoin experienced a modest pullback this morning, trading down 0.75% or 788.63 points to 104,321.06 as of 7:09 AM EDT. This movement reflects ongoing volatility in the cryptocurrency market, with investors weighing regulatory developments and macroeconomic factors.\n\nDespite the dip, Bitcoin remains above the 100,000 mark, signaling resilient demand among institutional and retail investors. Market watchers should monitor upcoming economic data and policy announcements that could influence crypto sentiment.\n\nFor those tracking Bitcoin's real-time performance, live updates are available to help navigate the fast-moving market dynamics.\n\nhttps://www.cnbc.com/quotes/BTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T11:09:53.420012"
  },
  {
    "title": "Trending Now\n\nBitcoin EUR rises to $91416.20",
    "summary": "Trading at $91416.20 with a +0.41% change. Market cap: $1817.0B, 24h volume: $35.0B",
    "link": "https://finance.yahoo.com/quote/BTC-EUR",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:52.845846"
  },
  {
    "title": "Trending Now\n\nBitcoin CAD rises to $142952.03",
    "summary": "Trading at $142952.03 with a +0.41% change. Market cap: $2841.0B, 24h volume: $54.7B",
    "link": "https://finance.yahoo.com/quote/BTC-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:52.845846"
  },
  {
    "title": "Trending Now\n\nBitcoin USD rises to $104377.84",
    "summary": "Trading at $104377.84 with a +0.41% change. Market cap: $2074.0B, 24h volume: $40.0B",
    "link": "https://finance.yahoo.com/quote/BTC-USD",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:52.845846"
  },
  {
    "title": "Binance co-founder CZ proposes dark pool DEXs to tackle manipulation",
    "summary": "Binance co-founder Changpeng CZ Zhao proposed launching a dark pool perpetual DEX to protect large traders from front-running and MEV attacks.",
    "link": "https://cointelegraph.com/news/binance-co-founder-cz-proposes-dark-pool-dexs-against-manipulation",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:51.767495"
  },
  {
    "title": "XRP price risks a 20% crash to $1.70  Here is why",
    "summary": "XRP ledger activity has dropped sharply in the past two months, increasing the downside prospects for XRP price to drop toward $1.70.",
    "link": "https://cointelegraph.com/news/xrp-price-risks-20-crash-1-70-here-is-why",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:51.767495"
  },
  {
    "title": "Crypto funds post $286M inflows as Ether tops buying: CoinShares",
    "summary": "Ether led last weeks $286 million of net inflows to crypto ETPs, while Bitcoin investment products saw outflows of $8 million, CoinShares reported.",
    "link": "https://cointelegraph.com/news/crypto-funds-286-million-inflows-heavy-selling-coinshares",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:51.767495"
  },
  {
    "title": "Singapore orders local crypto firms to cease overseas activity by June 30",
    "summary": "Singapores central bank has set a June 30 deadline for local crypto firms targeting overseas markets to halt operations or face steep penalties, including fines of almost $200,000.",
    "link": "https://cointelegraph.com/news/singapore-crypto-firms-deadline-overseas-digital-token-services",
    "image_url": null,
    "timestamp": "2025-06-02T17:09:51.767495"
  },
  {
    "title": "XRP.CM= Dips Slightly to $2.15 Amid Market Volatility",
    "summary": "XRP.CM= edged down by 0.65% to $2.15 as of the last trade at 6:31 AM EDT, reflecting a modest pullback in a volatile market environment.\n\nThis slight decline may indicate short-term profit-taking or market hesitation as investors await clearer signals on broader cryptocurrency trends. Given XRP’s historical sensitivity to regulatory news and market sentiment, traders should monitor upcoming developments closely.\n\nFor those interested in real-time updates and live tracking of XRP.CM= price movements, detailed market data is available here:\n\nhttps://www.cnbc.com/quotes/XRP.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:32:18.247472"
  },
  {
    "title": "SHIB.CM= Dips 1.70% to $0.00001269 Amid Market Volatility",
    "summary": "Shiba Inu (SHIB.CM=) experienced a notable decline of 1.70%, slipping to $0.00001269 as of the last trade at 6:32 AM EDT. This drop reflects ongoing volatility in the crypto market, where investors remain cautious amid broader economic uncertainties.\n\nDespite this pullback, SHIB continues to attract attention due to its strong community support and potential for short-term rebounds. Traders should monitor key technical levels and broader market trends to gauge SHIB's next moves.\n\nStay updated with live, real-time quotes and market analysis here for timely decision-making.\n\nhttps://www.cnbc.com/quotes/SHIB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:32:12.399940"
  },
  {
    "title": "Cardano (ADA) Dips 1.39% to $0.67 Amid Market Volatility",
    "summary": "Cardano (ADA) is trading lower this morning, down 1.39% at $0.67 as of 6:32 AM EDT. The slight pullback reflects broader market volatility impacting many cryptocurrencies, with investors assessing upcoming catalysts and macroeconomic factors.\n\nDespite the decline, ADA remains closely watched for its ongoing developments in blockchain scalability and smart contract adoption, which could drive future momentum.\n\nStay updated with real-time price movements and market analysis here:\n\nhttps://www.cnbc.com/quotes/ADA.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:32:06.296434"
  },
  {
    "title": "DOT.CM= slips 1.60% to $3.97 amid cautious market sentiment",
    "summary": "DOT.CM= experienced a modest decline, falling 1.60% to close at $3.97 as of 6:31 AM EDT. This dip reflects a cautious stance among investors, potentially influenced by broader market volatility and sector-specific pressures.\n\nDespite the setback, the price remains near key support levels, suggesting traders are closely monitoring upcoming catalysts that could drive the next directional move. Market participants are advised to keep an eye on evolving market conditions and any news impacting DOT.CM=.\n\nFor those tracking real-time developments and intraday fluctuations, live updates are available here:\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n\nStay tuned for further analysis as the trading day progresses.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:59.212474"
  },
  {
    "title": "UNI.CM= slips 1.10% to $6.13 amid early trading session pressure",
    "summary": "Shares of UNI.CM= edged down by 1.10%, closing at $6.13 in the early hours of trading.\n\nThis modest decline reflects cautious sentiment as investors digest recent market developments and sector-specific trends. While the dip is relatively small, it may indicate profit-taking or a pause before a potential rebound.\n\nFor those tracking UNI.CM= in real time, live updates are available to monitor how this trend unfolds throughout the trading day.\n\nhttps://www.cnbc.com/quotes/UNI.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:53.732691"
  },
  {
    "title": "LTC.CM= edges up 0.27% to $88.13 in early trading",
    "summary": "LTC.CM= showed a modest gain of 0.27%, rising by $0.23 to trade at $88.13 as of 6:31 AM EDT. This early movement suggests cautious optimism among investors, potentially reflecting positive sentiment or emerging news in the sector.\n\nThe price action indicates a stable start to the trading day, with traders likely weighing recent developments against broader market conditions. Keep an eye on LTC.CM= for further momentum shifts as the session progresses.\n\nFor real-time updates and live tracking of LTC.CM=, visit the link below.\n\nhttps://www.cnbc.com/quotes/LTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:47.340087"
  },
  {
    "title": "SOL.CM= slips 1.14% to $153.79 amid early trading session",
    "summary": "SOL.CM= experienced a modest pullback, declining 1.14% to $153.79 in early trading as of 6:31 AM EDT. This movement reflects some profit-taking following recent gains, suggesting cautious sentiment among investors.\n\nMarket participants are closely watching upcoming sector developments and broader economic indicators that could influence SOL.CM='s trajectory. The current price action underscores the importance of monitoring live market data for timely decision-making.\n\nFor real-time updates and detailed quote tracking, follow the live feed below:\n\nhttps://www.cnbc.com/quotes/SOL.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:42.309147"
  },
  {
    "title": "BNB.CM= Dips to $652.67 Amid Modest Market Pullback",
    "summary": "BNB closed at $652.67 as of 6:31 AM EDT, reflecting a slight decline of 0.31% or $2.05. This modest pullback suggests cautious sentiment among investors, potentially influenced by broader market volatility or sector-specific factors.\n\nDespite the minor dip, BNB remains positioned near key support levels, indicating resilience in the face of short-term pressures. Traders should monitor upcoming market catalysts that could drive renewed momentum or further consolidation.\n\nFor those tracking BNB in real-time, ongoing updates and detailed price action are available here:\n\nhttps://www.cnbc.com/quotes/BNB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:35.504197"
  },
  {
    "title": "Ethereum (ETH) Dips 1.49% to $2,484.84 Amid Market Volatility",
    "summary": "Ethereum (ETH) experienced a notable pullback, declining by 1.49% to trade at $2,484.84 as of 6:31 AM EDT. This drop of $37.63 reflects ongoing market volatility impacting major cryptocurrencies.\n\nInvestors are closely monitoring broader market trends and regulatory developments that may be influencing price movements in the digital asset space. Despite the dip, Ethereum remains a key player in the blockchain ecosystem, with its price action often signaling wider shifts in crypto sentiment.\n\nFor those seeking real-time updates and detailed price tracking, live data is available to stay informed on Ethereum's performance throughout the trading day.\n\nhttps://www.cnbc.com/quotes/ETH.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:28.327329"
  },
  {
    "title": "Bitcoin (BTC) Dips 0.61% to 104,467 Amid Market Volatility",
    "summary": "Bitcoin experienced a slight pullback, dropping 0.61% to $104,467 as of the latest trade at 6:31 AM EDT. This decline of 642.69 points reflects ongoing market fluctuations and investor caution in the crypto space.\n\nDespite the dip, Bitcoin remains above the $100,000 mark, indicating underlying strength amid broader economic uncertainties. Traders should watch for key support levels and monitor upcoming market catalysts that could influence momentum.\n\nFor real-time updates and live tracking of Bitcoin's price movements, follow the link below.\n\nhttps://www.cnbc.com/quotes/BTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T10:31:22.345875"
  },
  {
    "title": "Trending Now\n\nBitcoin EUR rises to $91426.25",
    "summary": "Trading at $91426.25 with a +0.43% change. Market cap: $1817.0B, 24h volume: $35.3B",
    "link": "https://finance.yahoo.com/quote/BTC-EUR",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:21.831514"
  },
  {
    "title": "Trending Now\n\nBitcoin CAD rises to $142984.62",
    "summary": "Trading at $142984.62 with a +0.43% change. Market cap: $2842.0B, 24h volume: $55.2B",
    "link": "https://finance.yahoo.com/quote/BTC-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:21.831514"
  },
  {
    "title": "Trending Now\n\nBitcoin USD rises to $104443.82",
    "summary": "Trading at $104443.82 with a +0.43% change. Market cap: $2076.0B, 24h volume: $40.3B",
    "link": "https://finance.yahoo.com/quote/BTC-USD",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:21.831514"
  },
  {
    "title": "XRP price risks a 20% crash to $1.70  Here is why",
    "summary": "XRP ledger activity has dropped sharply in the past two months, increasing the downside prospects for XRP price to drop toward $1.70.",
    "link": "https://cointelegraph.com/news/xrp-price-risks-20-crash-1-70-here-is-why",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:20.723643"
  },
  {
    "title": "Crypto funds post $286M inflows as Ether tops buying: CoinShares",
    "summary": "Ether led last weeks $286 million of net inflows to crypto ETPs, while Bitcoin investment products saw outflows of $8 million, CoinShares reported.",
    "link": "https://cointelegraph.com/news/crypto-funds-286-million-inflows-heavy-selling-coinshares",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:20.724631"
  },
  {
    "title": "Singapore orders local crypto firms to cease overseas activity by June 30",
    "summary": "Singapores central bank has set a June 30 deadline for local crypto firms targeting overseas markets to halt operations or face steep penalties, including fines of almost $200,000.",
    "link": "https://cointelegraph.com/news/singapore-crypto-firms-deadline-overseas-digital-token-services",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:20.724631"
  },
  {
    "title": "BitoPro confirms $11.5M exploit, says withdrawals unaffected",
    "summary": "Taiwan-based exchange BitoPro confirmed an $11.5 million crypto exploit weeks after the breach, saying user funds and withdrawals were unaffected.",
    "link": "https://cointelegraph.com/news/bitopro-exchange-11-5m-suspicious-outflow",
    "image_url": null,
    "timestamp": "2025-06-02T16:31:20.724631"
  },
  {
    "title": "Trending Now\n\nBitcoin USD rises to $105205.67",
    "summary": "Trading at $105205.67 with a +0.96% change. Market cap: $2091.0B, 24h volume: $36.6B",
    "link": "https://finance.yahoo.com/quote/BTC-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nXRP USD rises to $2.17",
    "summary": "Trading at $2.17 with a +0.35% change. Market cap: $127.3B, 24h volume: $1.8B",
    "link": "https://finance.yahoo.com/quote/XRP-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nBitcoin CAD rises to $144305.14",
    "summary": "Trading at $144305.14 with a +0.96% change. Market cap: $2868.0B, 24h volume: $50.2B",
    "link": "https://finance.yahoo.com/quote/BTC-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nSolana USD rises to $157.30",
    "summary": "Trading at $157.30 with a +1.57% change. Market cap: $82.2B, 24h volume: $2.6B",
    "link": "https://finance.yahoo.com/quote/SOL-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nMonero USD rises to $343.26",
    "summary": "Trading at $343.26 with a +6.95% change. Market cap: $6.3B, 24h volume: $0.1B",
    "link": "https://finance.yahoo.com/quote/XMR-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nDogecoin USD rises to $0.19",
    "summary": "Trading at $0.19 with a +1.34% change. Market cap: $28.6B, 24h volume: $0.9B",
    "link": "https://finance.yahoo.com/quote/DOGE-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nEthereum USD rises to $2517.19",
    "summary": "Trading at $2517.19 with a +0.36% change. Market cap: $303.9B, 24h volume: $12.0B",
    "link": "https://finance.yahoo.com/quote/ETH-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nXRP CAD rises to $2.97",
    "summary": "Trading at $2.97 with a +0.35% change. Market cap: $174.6B, 24h volume: $2.4B",
    "link": "https://finance.yahoo.com/quote/XRP-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nEthereum CAD rises to $3452.70",
    "summary": "Trading at $3452.70 with a +0.36% change. Market cap: $416.8B, 24h volume: $16.5B",
    "link": "https://finance.yahoo.com/quote/ETH-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nZebec Network USD rises to $0.01",
    "summary": "Trading at $0.01 with a +16.79% change. Market cap: $0.5B, 24h volume: $0.1B",
    "link": "https://finance.yahoo.com/quote/ZBCN-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Trending Now\n\nCardano USD rises to $0.68",
    "summary": "Trading at $0.68 with a +0.76% change. Market cap: $24.0B, 24h volume: $0.6B",
    "link": "https://finance.yahoo.com/quote/ADA-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:40.761361"
  },
  {
    "title": "Wintermutes CrimeEnjoyor to flag Ethereums wallet-draining contracts",
    "summary": "Wintermute has created code that warns of malicious code in Ethereum delegate contracts to protect users from a new wallet-draining tactic.",
    "link": "https://cointelegraph.com/news/wintermute-crimeenjoyor-flags-malicious-ethereum-contracts",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:39.686973"
  },
  {
    "title": "Heres what happened in crypto today",
    "summary": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:39.686973"
  },
  {
    "title": "Traders shift to short-term tactics in response to tariffs  Web3 CEO",
    "summary": "Traders are maximizing short-term profit strategies as the long-term economic outlook becomes increasingly unclear, Arrash Yasavolian said.",
    "link": "https://cointelegraph.com/news/traders-shift-short-term-tactics-response-tariffs",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:39.686973"
  },
  {
    "title": "Strategy's Michael Saylor signals impending Bitcoin purchase",
    "summary": "According to data from SaylorTracker, Strategy's BTC investment is up over 50%, representing unrealized capital gains of over $20 billion.",
    "link": "https://cointelegraph.com/news/strategy-saylor-signals-impending-bitcoin-purchase",
    "image_url": null,
    "timestamp": "2025-06-02T08:29:39.686973"
  },
  {
    "title": "XRP (XRP.CM=) Edges Lower to $2.17 Amid Market Volatility",
    "summary": "XRP's latest trading session saw the price dip slightly by 1.36%, settling at $2.17 as of 10:26 PM EDT. This modest decline reflects cautious investor sentiment amid broader market fluctuations impacting the cryptocurrency sector.\n\nDespite the pullback, XRP continues to demonstrate resilience in a volatile environment, suggesting that traders remain attentive to potential catalysts that could influence its trajectory. Market participants are advised to monitor real-time movements closely as conditions evolve.\n\nFor live updates and detailed price tracking, visit the link below:\n\nhttps://www.cnbc.com/quotes/XRP.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:35.873539"
  },
  {
    "title": "SHIB.CM= Edges Slightly Lower to $0.00001283 Amid Modest Market Pressure",
    "summary": "Shiba Inu (SHIB.CM=) experienced a marginal decline, slipping 0.08% to a price of $0.00001283 as of 10:26 PM EDT. This slight dip reflects a cautious trading environment where investors are weighing the token's volatility against broader market dynamics.\n\nDespite the minor setback, SHIB remains a focal point for crypto enthusiasts due to its strong community support and recent developments in the decentralized finance space. Traders are advised to monitor ongoing market sentiment closely, as shifts in investor confidence could influence SHIB's trajectory in the near term.\n\nFor those tracking live price movements and market updates, real-time data is available to support timely decision-making.\n\nhttps://www.cnbc.com/quotes/SHIB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:28.983494"
  },
  {
    "title": "Cardano (ADA) Dips 1.46% to $0.68 Amid Market Volatility",
    "summary": "Cardano (ADA) experienced a modest pullback, declining 1.46% to $0.68 as of the last trade at 10:26 PM EDT. This movement reflects some profit-taking amid broader market fluctuations affecting the crypto sector.\n\nInvestors are closely watching ADA’s price action for signs of stabilization or further downside, especially given its recent attempts to regain momentum. The current price level could present a critical support zone that may influence near-term trading decisions.\n\nFor those seeking real-time updates and detailed market data on ADA, live tracking is available at the link below.\n\nhttps://www.cnbc.com/quotes/ADA.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:23.483212"
  },
  {
    "title": "DOT.CM slips 1.45% to $4.04 amid market pressure",
    "summary": "Polkadot (DOT.CM=) experienced a modest decline, dropping 1.45% to $4.04 as of 10:26 PM EDT. This movement reflects cautious investor sentiment as broader market uncertainties weigh on altcoins.\n\nDespite the pullback, Polkadot remains a key player in the blockchain ecosystem, with its price action closely watched by traders for potential entry points. The current dip could signal a short-term correction amid ongoing volatility.\n\nStay updated with live price movements and in-depth market analysis by following the real-time quote link below.\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:17.337318"
  },
  {
    "title": "LTC.CM= edges up slightly to $87.73 amid cautious market sentiment",
    "summary": "LTC.CM= showed a marginal gain, rising by $0.06 to close at $87.73 as of 10:26 PM EDT. The modest uptick of 0.06% reflects a cautious yet steady investor appetite amid broader market uncertainties.\n\nThis slight positive movement suggests that while volatility remains, LTC.CM= is holding its ground, indicating potential resilience as traders weigh upcoming economic data and sector-specific developments.\n\nFor those tracking real-time price action and market dynamics, live updates are available to monitor how LTC.CM= navigates evolving market conditions.\n\nhttps://www.cnbc.com/quotes/LTC.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:10.046124"
  },
  {
    "title": "SOL.CM= edges slightly lower to $157.10 amid modest market pullback",
    "summary": "SOL.CM= shares dipped by 0.35% to close at $157.10 as of 10:26 PM EDT, reflecting a mild retreat after recent gains. This slight pullback may indicate cautious investor sentiment amid broader market fluctuations.\n\nInvestors are advised to monitor ongoing developments closely, as the price movement could signal short-term consolidation before the next directional move. For those tracking SOL.CM= in real time, updated quotes are available to stay informed on the latest market action.\n\nhttps://www.cnbc.com/quotes/SOL.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:06.683545"
  },
  {
    "title": "BNB Climbs to $660.77, Showing Steady Gains Amid Market Optimism",
    "summary": "BNB (BNB.CM=) has edged higher to $660.77, up by 1.41 points or 0.21%, reflecting cautious optimism among investors.\n\nThis modest uptick suggests continued confidence in BNB's underlying fundamentals despite broader market volatility. Traders appear to be responding positively to recent developments in the crypto sector, with BNB maintaining resilience.\n\nFor those tracking live market movements and seeking real-time updates, follow the latest price action and trends here:\n\nhttps://www.cnbc.com/quotes/BNB.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:26:02.310562"
  },
  {
    "title": "Ethereum (ETH) Dips Nearly 1% to $2,516 Amid Market Volatility",
    "summary": "Ethereum (ETH) experienced a modest pullback, trading down 0.96% to $2,516.34 as of 10:25 PM EDT. This decline of $24.41 reflects ongoing market fluctuations and profit-taking after recent rallies in the crypto space.\n\nInvestors remain cautious as broader market sentiment continues to be influenced by macroeconomic factors and regulatory developments impacting digital assets. Despite the dip, Ethereum's fundamentals and network upgrades keep it in focus for longer-term growth potential.\n\nStay updated with live, real-time ETH price movements and market trends here for timely insights and trading decisions.\n\nhttps://www.cnbc.com/quotes/ETH.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:25:56.892294"
  },
  {
    "title": "Bitcoin (BTC) Edges Higher to $105,193.77 Amid Modest Gains",
    "summary": "Bitcoin continues to show resilience as it edges up by $437.07, a 0.42% increase, reaching $105,193.77 as of 10:25 PM EDT. This modest gain reflects cautious optimism among investors amid ongoing market volatility and macroeconomic uncertainties.\n\nMarket participants appear to be consolidating recent gains, with Bitcoin holding steady above the $105,000 psychological level. Traders are closely watching for any shifts in sentiment that could drive further momentum in either direction.\n\nFor real-time updates and detailed price tracking, follow the live market data here:\n\nhttps://www.cnbc.com/quotes/BTC.CM=\n\nStay tuned for further developments as Bitcoin navigates through this critical price zone.",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:25:48.519983"
  },
  {
    "title": "Trending Now\n\nBitcoin USD rises to $105236.04",
    "summary": "Trading at $105236.04 with a +1.03% change. Market cap: $2091.0B, 24h volume: $36.6B",
    "link": "https://finance.yahoo.com/quote/BTC-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nXRP USD rises to $2.16",
    "summary": "Trading at $2.16 with a +0.38% change. Market cap: $127.2B, 24h volume: $1.8B",
    "link": "https://finance.yahoo.com/quote/XRP-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nBitcoin CAD rises to $144333.23",
    "summary": "Trading at $144333.23 with a +1.03% change. Market cap: $2868.0B, 24h volume: $50.2B",
    "link": "https://finance.yahoo.com/quote/BTC-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nSolana USD rises to $157.14",
    "summary": "Trading at $157.14 with a +1.54% change. Market cap: $82.1B, 24h volume: $2.6B",
    "link": "https://finance.yahoo.com/quote/SOL-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nMonero USD rises to $342.60",
    "summary": "Trading at $342.60 with a +6.77% change. Market cap: $6.3B, 24h volume: $0.1B",
    "link": "https://finance.yahoo.com/quote/XMR-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nDogecoin USD rises to $0.19",
    "summary": "Trading at $0.19 with a +1.32% change. Market cap: $28.6B, 24h volume: $0.9B",
    "link": "https://finance.yahoo.com/quote/DOGE-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nEthereum USD rises to $2517.13",
    "summary": "Trading at $2517.13 with a +0.45% change. Market cap: $303.9B, 24h volume: $12.0B",
    "link": "https://finance.yahoo.com/quote/ETH-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nXRP CAD rises to $2.97",
    "summary": "Trading at $2.97 with a +0.38% change. Market cap: $174.4B, 24h volume: $2.4B",
    "link": "https://finance.yahoo.com/quote/XRP-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nEthereum CAD rises to $3452.29",
    "summary": "Trading at $3452.29 with a +0.45% change. Market cap: $416.8B, 24h volume: $16.5B",
    "link": "https://finance.yahoo.com/quote/ETH-CAD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nZebec Network USD rises to $0.01",
    "summary": "Trading at $0.01 with a +16.65% change. Market cap: $0.5B, 24h volume: $0.1B",
    "link": "https://finance.yahoo.com/quote/ZBCN-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Trending Now\n\nCardano USD rises to $0.68",
    "summary": "Trading at $0.68 with a +0.81% change. Market cap: $24.1B, 24h volume: $0.6B",
    "link": "https://finance.yahoo.com/quote/ADA-USD",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:48.011852"
  },
  {
    "title": "Wintermutes CrimeEnjoyor to flag Ethereums wallet-draining contracts",
    "summary": "Wintermute has created code that warns of malicious code in Ethereum delegate contracts to protect users from a new wallet-draining tactic.",
    "link": "https://cointelegraph.com/news/wintermute-crimeenjoyor-flags-malicious-ethereum-contracts",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:45.837921"
  },
  {
    "title": "Heres what happened in crypto today",
    "summary": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:45.837921"
  },
  {
    "title": "Traders shift to short-term tactics in response to tariffs  Web3 CEO",
    "summary": "Traders are maximizing short-term profit strategies as the long-term economic outlook becomes increasingly unclear, Arrash Yasavolian said.",
    "link": "https://cointelegraph.com/news/traders-shift-short-term-tactics-response-tariffs",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:45.837921"
  },
  {
    "title": "Strategy's Michael Saylor signals impending Bitcoin purchase",
    "summary": "According to data from SaylorTracker, Strategy's BTC investment is up over 50%, representing unrealized capital gains of over $20 billion.",
    "link": "https://cointelegraph.com/news/strategy-saylor-signals-impending-bitcoin-purchase",
    "image_url": null,
    "timestamp": "2025-06-02T08:25:45.837921"
  },
  {
    "title": "DOT.CM= slips 1.08% to $4.06 amid cautious market sentiment",
    "summary": "Polkadot (DOT.CM=) experienced a modest pullback, closing at $4.06, down 1.08% as of 10:03 PM EDT. This slight decline reflects a cautious investor stance amid broader market uncertainties impacting the cryptocurrency sector.\n\nDespite the dip, Polkadot remains a significant player in the blockchain ecosystem, with its innovative approach to interoperability continuing to attract long-term interest. Traders and investors should monitor upcoming developments and market trends that could influence its trajectory.\n\nFor those seeking real-time updates and detailed price movements, the live tracking link below provides comprehensive market data.\n\nhttps://www.cnbc.com/quotes/DOT.CM=\n",
    "link": "",
    "image_url": null,
    "timestamp": "2025-06-02T02:03:53.593899"
  }
]